# BETWEEN...AND

In [1]:
%LOAD data/example.db

Met `BETWEEN ... AND` kun je een query maken met een beperking tussen twee randen. De randen doen mee met de selectie. De onderste rand moet als eerste genoemd worden, want anders krijg je een leeg resultaat terug. De randen doen mee, zoals je in onderstaand voorbeeld kunt zien.

In [2]:
SELECT last_name, salary
FROM employees
WHERE salary BETWEEN 9000 AND 11000;

+-----------+--------+
| last_name | salary |
+-----------+--------+
| Hunold    | 9000   |
+-----------+--------+
| Zlotkey   | 10500  |
+-----------+--------+
| Abel      | 11000  |
+-----------+--------+

Deze query kun je ook zo maken.

In [3]:
SELECT last_name, salary
FROM employees
WHERE salary >= 9000 AND salary <= 11000;

+-----------+--------+
| last_name | salary |
+-----------+--------+
| Hunold    | 9000   |
+-----------+--------+
| Zlotkey   | 10500  |
+-----------+--------+
| Abel      | 11000  |
+-----------+--------+

Ook voor datums kun je `BETWEEN ... AND` gebruiken. Wie is er in dienst gekomen tussen 1 januari 1994 en 31 december 1997?

In [4]:
SELECT last_name, hire_date
FROM employees
WHERE hire_date BETWEEN '1994-01-01' AND '1997-12-31';

+-----------+------------+
| last_name | hire_date  |
+-----------+------------+
| Rajs      | 1995-10-17 |
+-----------+------------+
| Davies    | 1997-01-29 |
+-----------+------------+
| Abel      | 1996-05-11 |
+-----------+------------+
| Hartstein | 1996-02-17 |
+-----------+------------+
| Fay       | 1997-08-17 |
+-----------+------------+
| Higgins   | 1994-06-07 |
+-----------+------------+
| Gietz     | 1994-06-07 |
+-----------+------------+